Repository: Alusus/Nashir
Catalog: *.po
Languages: ar

source: Unexpected communication error! Retry?
ar: خطأ غير متوقع في الاتصال. أترغب بإعادة المحاولة؟

source: Existing auth key is no longer valid. Requesting a new auth key.
ar: مفتاح التوثيق الحالي غير صالح. سيُطلب مفتاح جديد.

source: Enter username: >
ar: أدخل اسم المستخدم: >

source: Enter password: >
ar: أدخل كلمة السر: >

source: Authentication error. Invalid username or password.
ar: خطأ في المصادقة. اسم المستخدم أو كلمة السر غير صالحة.

source: Authentication error. Invalid password.
ar: خطأ في المصادقة. كلمة السر غير صالحة.

source: Authentication error. Invalid username.
ar: خطأ في المصادقة. اسم المستخدم غير صالح.

source: Authentication error.
ar: خطأ في المصادقة.

source: Existing project with the same name exists. The project will be overwritten. Continue (yes/no)?
ar: يوجد مشروع حالي بنفس الاسم. ستؤدي العملية لاستبداله بالنسخة الجديدة. أترغب بالاستمرار (نعم/لا)؟

source: Existing, but inactive, project with the same name exists. This project is in an invalid state and cannot be re-activated. Contact AlususNet's support to resolve the issue, or change your project's name to create a new project on AlususNet.
ar: يوجد مشروع حالي بنفس الاسم لكنه غير مفعّل. هذا المشروع في حالة غير صالحة ولا يمكن إعادة تفعيله. اتصل بخدمة عملاء الأسس نت لحل المشكلة، أو غير اسم المشروع لإنشاء مشروع جديد على الأسس نت.

source: Existing, but inactive, project with the same name exists. The project will be re-activated and overwritten. A new payment plan will be setup.
ar: يوجد مشروع حالي بنفس الاسم لكنه غير مفعّل. ستؤدي العملية إلى تفعيله وتحديث شفرته وسيؤدي ذلك إلى إنشاء خطة دفع إلكتروني جديدة.

source: No existing project found with the same name. A new project will be created and a payment plan will be setup for it.
ar: لا يوجد مشروع بهذا الاسم. ستؤدي العملية إلى إنشاء مشروع جديد وإنشاء خطة دفع إلكتروني جديدة.

source: Some operation is currently in progress on this project's container. Retry (yes/no)?
ar: بعض العمليات تتم حاليًا في الخادم على هذا المشروع ويجب الانتظار حتى تكتمل تلك العمليات. إعادة المحاولة (نعم/لا)؟

source: Continue? (Type `yes` to proceed, `no` to cancel, or `coupon` to enter a promotion code)
ar: أترغب بالاستمرار؟ (أدخل `نعم` للاستمرار أو `لا` للإلغاء أو `قسيمة` لإدخال رمزٍ ترويجي)

source: Continue? (Type `yes` to proceed, `no` to cancel, `plan` to change the hosting plan, or `coupon` to enter a promotion code)
ar: أترغب بالاستمرار؟ (أدخل `نعم` للاستمرار أو `لا` للإلغاء أو `مستوى` لاختيار مستوى خدمة الاستضافة أو `قسيمة` لإدخال رمزٍ ترويجي)

source: Enter promotion code:
ar: أدخل الرمز الترويجي:

source: Please setup your payment profile by visiting this URL: %s Press enter when you're done.
ar: يُرجى ضبط إعدادات الدفع عبر هذا الرابط: %s اضغط زر الإدخال عند الانتهاء.

source: Hosting plan:
ar: مستوى خدمة الاستضافة:

source: %s - %s. Monthly cost: $%s USD
ar: %s - %s. الكلفة الشهرية: $%s دولار أمريكي

source: Select a plan:
ar: اختر مستوى خدمة الاستضافة:

source: Deployment successful.
ar: تم النشر بنجاح.

source: Upload failed. File is too big!
ar: فشل التحميل. الملف أكبر من الحجم الأقصى!

source: Unexpected error. Try re-starting the deployment.
ar: خطأ غير متوقع. يُرجى إعادة تشغيل عملية النشر.

source: Build complete.
ar: اكتمل البناء.

source: Program uploaded.
ar: حُمل البرنامج.

source: Invalid entry.
ar: مدخلة غير صالحة.

source: Build failed.
ar: فشل البناء.

source: Failed to fetch product info from AlususNet
ar: فشل جلب بيانات المنتجات من الأسس نت

source: Project name is not valid.
ar: اسم المشروع غير صالح.

source: Enter promotion code or leave empty to proceed without a promotion code:
ar: أدخل رمزًا ترويجيًا أو اترك الحقل فارغًا للاستمرار بدون رمزٍ ترويجي:

source: Provided promotion code is invalid. Re-enter prmotion code? (Type `yes` to enter a new code or `cancel` to quit)
ar: الرمز الترويجي المدخل غير صالح. أترغب بإدخال رمز جديد؟ (أدخل `نعم` لإدخال رمز جديد أو `ألغ` للخروج)

source: Publishing failed: Uploading to the server failed.
ar: فشل النشر: فشل التحميل إلى الخادم.

source: Publishing failed: Restarting the service failed.
ar: فشل النشر: فشلت إعادة تشغيل الخدمة.

source: Service restarted.
ar: أُعيد تشغيل الخدمة.

source: Publishing completed successfully.
ar: تم النشر بنجاح.

source: Enter SSH username to use for publishing:
ar: أدخل اسم المستخدم لجلسة SSH المستخدمة للنشر:

source: Enter SSH host to use for publishing:
ar: أدخل عنوان الخادم لجلسة SSH المستخدمة للنشر:

source: Enter SSH port to use for publishing:
ar: أدخل منفذ SSH المستخدم للنشر:

source: Invalid port number.
ar: رقم المنفذ غير صالح.

source: Enter path on the server where the code will be published:
ar: أدخل المسار على الخادم حيث سيخزن البرنامج:

source: Enter the name of the systemd service to be restarted after publishing, or leave this empty to skip service restarting:
ar: أدخل اسم خدمة systemd التي سيتم إعادة تشغيلها بعد النشر، أو اترك الحقل فارغًا لتجاوز إعادة تشغيل الخدمة:

source: Error: Invalid argument Usage: alusus <main_alusus_file> [build|publish]
ar: خطأ: المعطى غير صالح طريقة الاستخدام: الأسس <اسم_الملف_الرئيسي> [ابن|انشر]

source: Uploading: %d%%
ar: تحميل: %d%%

source: نعم
ar: yes

source: لا
ar: no

source: ألغ
ar: cancel

source: قسيمة
ar: coupon

source: مستوى
ar: plan

source: ابن
ar: build

source: انشر
ar: publish

source: Invalid project name. It should only contain lowercase letters, numbers, hyphens (-), and must not start or end with a hyphen
ar: اسم المشروع غير صالح. يجب أن يحتوي فقط على أحرف صغيرة، أرقام، وشرطات (-)، ويجب ألا يبدأ أو ينتهي بشرطة.

source: Enter mfaCode: >
ar: أدخل رمز التحقق متعدد العوامل: >

source: The account is locked due to multiple incorrect password attempts. Please try again later.
ar: تم قفل الحساب بسبب محاولات متعددة لإدخال كلمة مرور غير صحيحة. يرجى المحاولة مرة أخرى لاحقًا.

source: Entered information is invalid!
ar: المعلومات المدخلة غير صحيحة!
